app/controllers/movies_controller.rb

  def add_tmdb
    if params[:tmdb_movies].nil?
      flash[:notice] = "No movies selected."
    else
      @movie_ids = params[:tmdb_movies].keys
      @movie_ids.each do |m|
        Movie.create_from_tmdb(m)
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)